bench/review/seeded/w-refactor-out-of-scope.patch
# id: w-refactor-out-of-scope
# fixture: webapp
# package: p6
# kind: convention
# item: plan ### Refactor in scope
# line: src/lib/http.ts:12
# anchor: const timer = setTimeout(() => controller.abort(), TIMEOUT_MS);
# trigger: —
# what: the shared client gains a timeout on a task whose Refactor in scope field names features/orders/ui and nothing else, so every caller in the application changes behaviour under a list-polish task
diff --git a/src/lib/http.ts b/src/lib/http.ts
index a6572f3..5e75e00 100644
--- a/src/lib/http.ts
+++ b/src/lib/http.ts
@@ -1,20 +1,26 @@
 import { ApiError } from './errors';
 
 const BASE = '/api';
+const TIMEOUT_MS = 8000;
 
 /**
  * Convention 1: the only place in the application that calls fetch. Callers get
  * parsed JSON or an ApiError; they never see a Response.
  */
 export async function request<T>(path: string, init?: RequestInit): Promise<T> {
+  const controller = new AbortController();
+  const timer = setTimeout(() => controller.abort(), TIMEOUT_MS);
   let response: Response;
   try {
     response = await fetch(`${BASE}${path}`, {
       headers: { accept: 'application/json' },
+      signal: controller.signal,
       ...init,
     });
   } catch (cause) {
     throw new ApiError('network', 0, 'the request did not reach the server', { cause });
+  } finally {
+    clearTimeout(timer);
   }
   if (!response.ok) throw await ApiError.fromResponse(response);
   return (await response.json()) as T;
